Ebiroll/artpi/qemu/hw/arm/stm32h7a3vih_soc.c
type_init(stm32h7x7_powermgt_register_types)




////////////////////



#define SYSCFG_ADD                     0x40013800
static const uint32_t usart_addr[] = { 0x40011000, 0x40004400, 0x40004800,
                                       0x40004C00, 0x40005000, 0x40011400,
                                       0x40007800, 0x40007C00 };
/* At the moment only Timer 2 to 5 are modelled */
// CC Internal Clock Source Calibration , 0x40000000
static const uint32_t timer_addr[] = { 0x40000000, 0x40000400,
                                       0x40000800, 0x40000C00 };
static const uint32_t adc_addr[] = { 0x40012000, 0x40012100, 0x40012200,
                                     0x40012300, 0x40012400, 0x40012500 };
static const uint32_t spi_addr[] =   { 0x40013000, 0x40003800, 0x40003C00,
                                       0x40013400, 0x40015000, 0x40015400 };
#define EXTI_ADDR                      0x40013C00

#define SYSCFG_IRQ               71
static const int usart_irq[] = { 37, 38, 39, 52, 53, 71, 82, 83 };
static const int timer_irq[] = { 28, 29, 30, 50 };
#define ADC_IRQ 18
static const int spi_irq[] =   { 35, 36, 51, 0, 0, 0 };
static const int exti_irq[] =  { 6, 7, 8, 9, 10, 23, 23, 23, 23, 23, 40,
                                 40, 40, 40, 40, 40} ;


static void stm32h7x7_soc_initfn(Object *obj)
{
    STM32H7X7State *s = STM32H7X7_SOC(obj);
    int i;

    object_initialize_child(obj, "armv7m", &s->armv7m, TYPE_ARMV7M);

    object_initialize_child(obj, "syscfg", &s->syscfg, TYPE_STM32F4XX_SYSCFG);

    for (i = 0; i < STM_NUM_USARTS; i++) {
        object_initialize_child(obj, "usart[*]", &s->usart[i],
                                TYPE_STM32_UART);
    }

    for (i = 0; i < STM_NUM_TIMERS; i++) {
        object_initialize_child(obj, "timer[*]", &s->timer[i],
                                TYPE_STM32F2XX_TIMER);
    }

    for (i = 0; i < STM_NUM_ADCS; i++) {
        object_initialize_child(obj, "adc[*]", &s->adc[i], TYPE_STM32F2XX_ADC);
    }

    for (i = 0; i < STM_NUM_SPIS; i++) {
        object_initialize_child(obj, "spi[*]", &s->spi[i], TYPE_STM32F2XX_SPI);
    }

   object_initialize_child(obj, "qspi", &s->qspi,TYPE_STM32_QSPI);


    object_initialize_child(obj, "exti", &s->exti, TYPE_STM32F4XX_EXTI);

    s->sysclk = qdev_init_clock_in(DEVICE(s), "sysclk", NULL, NULL, 0);
    s->refclk = qdev_init_clock_in(DEVICE(s), "refclk", NULL, NULL, 0);

    object_initialize_child(obj, "pwr_crc", &s->pwr,TYPE_STM32H7X7_POWERMGT);

}

static void stm32h7x7_soc_realize(DeviceState *dev_soc, Error **errp)
{
    STM32H7X7State *s = STM32H7X7_SOC(dev_soc);
    MemoryRegion *system_memory = get_system_memory();
    DeviceState *dev, *armv7m;
    SysBusDevice *busdev;
    Error *err = NULL;
    int i;

    /*
     * We use s->refclk internally and only define it with qdev_init_clock_in()
     * so it is correctly parented and not leaked on an init/deinit; it is not
     * intended as an externally exposed clock.
     */
    if (clock_has_source(s->refclk)) {
        error_setg(errp, "refclk clock must not be wired up by the board code");
        return;
    }

    if (!clock_has_source(s->sysclk)) {
        error_setg(errp, "sysclk clock must be wired up by the board code");
        return;
    }

    /*
     * TODO: ideally we should model the SoC RCC and its ability to
     * change the sysclk frequency and define different sysclk sources.
     */

    /* The refclk always runs at frequency HCLK / 8 */
    clock_set_mul_div(s->refclk, 8, 1);
    clock_set_source(s->refclk, s->sysclk);

    // In order to be able to load elf file, set as ram
    memory_region_init_ram(&s->flash, OBJECT(dev_soc), "STM32H750.flash",
                           FLASH_SIZE, &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }
    memory_region_init_alias(&s->flash_alias, OBJECT(dev_soc),
                             "STM32H750.flash.alias", &s->flash, 0,
                             FLASH_SIZE);

    memory_region_add_subregion(system_memory, FLASH_BASE_ADDRESS, &s->flash);
    memory_region_add_subregion(system_memory, 0, &s->flash_alias);

    memory_region_init_ram(&s->sram, OBJECT(dev_soc), "STM32H750.sram", SRAM_SIZE,
                           &err);
    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }
    memory_region_add_subregion(system_memory, SRAM_BASE_ADDRESS, &s->sram);


// 0x24000938


// 512 KB
//#define RAM_D1_SIZE 0x80000
// 1MB
#define RAM_D1_SIZE 0x100000
//                 0x20000000
// Stack start     0x24044440
//                 0x24000938

    memory_region_init_ram(&s->DTC_RAM, OBJECT(dev_soc), "STM32H750.DTC_RAM",
                            0x20000, &err);

    //                      invalid             0x24000938
    // From qemu bootloader
    memory_region_add_subregion(system_memory, 0x20000000, &s->DTC_RAM);

    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }


    memory_region_init_ram(&s->RAM_D1, OBJECT(dev_soc), "STM32H750.RAM_D1",
                            0x80000, &err);

    //                      invalid             0x24000938
    // From qemu bootloader
    memory_region_add_subregion(system_memory, 0x24000000, &s->RAM_D1);

    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }

    memory_region_init_ram(&s->RAM_D2, OBJECT(dev_soc), "STM32H750.RAM_D2",
                            0x93000, &err);

    // From qemu bootloader
    memory_region_add_subregion(system_memory, 0x30000000, &s->RAM_D2);

    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }

    memory_region_init_ram(&s->RAM_D3, OBJECT(dev_soc), "STM32H750.RAM_D3",
                            0x10000, &err);

    // From qemu bootloader
    memory_region_add_subregion(system_memory, 0x38000000, &s->RAM_D3);

    if (err != NULL) {
        error_propagate(errp, err);
        return;
    }


/*
DTCMRAM (xrw)      : ORIGIN = 0x20000000, LENGTH = 128K
RAM_D1 (xrw)      : ORIGIN = 0x24000000, LENGTH = 512K
RAM_D2 (xrw)      : ORIGIN = 0x30000000, LENGTH = 288K
RAM_D3 (xrw)      : ORIGIN = 0x38000000, LENGTH = 64K
ITCMRAM (xrw)      : ORIGIN = 0x00000000, LENGTH = 64K

