Ebiroll/artpi/qemu/hw/arm/stm32h7a3vih_soc.c
/*

"LPTIM1_TIM14_TIM13_TIM12_TIM7_TIM6_TIM5_TIM4_TIM3_TIM2","40000000","0x2800"
"I2C1_I2C2_I2C3_UART5_UART4_USART3_USART2_SPDIFRX_SPI3_SPI2","40003800","0x2800"
"CEC","40006c00","0x400"
"DAC_UART7_UART8","40007400","0xc00"
"CRS_SWPMI","40008400","0x800"
"MDIOS_OPAMP","40009000","0x800"
"FDCAN_TT_FDCAN_CAN_CCU","4000a000","0xc00"
"TIM1_TIM8","40010000","0x800"
"USART1_USART6","40011000","0x800"

"SPI1_SPI4","40013000","0x800"
"TIM16_TIM17_TIM15","40014000","0xc00"
"SPI5","40015000","0x400"
"SAI1_SAI2","40015800","0x800"
"HRTIM_Master_HRTIM_TIMA_HRTIM_TIMB_HRTIM_TIMC_HRTIM_TIMD_HRTIM_TIME_DFSDM","40017000","0x700"
"HRTIM_Common","40017780","0x80"
"USART9","40018000","0x400"
"USART10","4001c000","0x400"
"DMAMUX1_DMA2_DMA1","40020000","0xc00"
"ADC1_ADC2","40022000","0x200"
"ADC12_Common","40022300","0x100"
"Ethernet_MAC","40028000","0x1400"
"OTG1_HS_GLOBAL_OTG1_HS_HOST_OTG1_HS_DEVICE","40040000","0xc00"
"OTG2_HS_GLOBAL_OTG2_HS_HOST_OTG2_HS_DEVICE_OTG1_HS_PWRCLK","40040e00","0x3fe00"
"OTG2_HS_PWRCLK","40080e00","0x3f200"
"DCMI","48020000","0x400"
"RNG","48021800","0x400"
"SDMMC2","48022400","0x3fd"

---->






"BDMA1_DELAY_Block_SDMMC2","48022800","0x800"
"LTDC","50001000","0x1000"
"WWDG","50003000","0x400"
"AXI","51000000","0x100000"
"DMA2D_MDMA","52000000","0x1400"
"JPEG_Flash","52002000","0x1400"
"FMC","52004000","0x400"
"Delay_Block_OCTOSPI1_OCTOSPI1_CONTROL_REGISTER","52005000","0x1400"
"SDMMC1","52007000","0x3fd"
"DELAY_Block_SDMMC1","52008000","0x400"
"RAMECC","52009000","0x400"
"Delay_Block_OCTOSPI2_OCTOSPI2_OctoSPII_O_Manager","5200a000","0x1800"
"SYSCFG_EXTI","58000000","0x800"
"LPUART1","58000c00","0x400"
"SPI6","58001400","0x400"
"I2C4","58001c00","0x400"
"LPTIM2_LPTIM3","58002400","0x800"
"COMP1_VREFBUF_RTC","58003800","0xc00"
"IWDG","58004800","0x400"
"GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK","58020000","0x2c00"
"PWR_CRC_RCC","58024400","0xc00"
"BDMA2_DMAMUX2","58025400","0x800"
"HSEM","58026400","0x400"
"SCB_ACTRL","e000e008","0x5"
"STK","e000e010","0x11"
"NVIC","e000e100","0x3c5"
"SCB","e000ed00","0x41"
"PF","e000ed78","0xd"
"FPU_CPACR","e000ed88","0x5"
"MPU","e000ed90","0x15"
"NVIC_STIR","e000ef00","0x5"
"FPU","e000ef34","0xd"
"AC","e000ef90","0x1d"


*/



////////////
/*
"LPTIM1_TIM14_TIM13_TIM12_TIM7_TIM6_TIM5_TIM4_TIM3_TIM2","40000000","0x2800"
"I2C1_I2C2_I2C3_UART5_UART4_USART3_USART2_SPDIFRX_SPI3_SPI2","40003800","0x2800"


"SPI1_SPI4","40013000","0x800"
"TIM16_TIM17_TIM15","40014000","0xc00"
"SPI5","40015000","0x400"
"SAI1_SAI2","40015800","0x800"
"HRTIM_Master_HRTIM_TIMA_HRTIM_TIMB_HRTIM_TIMC_HRTIM_TIMD_HRTIM_TIME_DFSDM","40017000","0x700"
"HRTIM_Common","40017780","0x80"
"USART9","40018000","0x400"
"USART10","4001c000","0x400"
"DMAMUX1_DMA2_DMA1","40020000","0xc00"
"ADC1_ADC2","40022000","0x200"
"ADC12_Common","40022300","0x100"
"Ethernet_MAC","40028000","0x1400"
"OTG1_HS_GLOBAL_OTG1_HS_HOST_OTG1_HS_DEVICE","40040000","0xc00"
"OTG2_HS_GLOBAL_OTG2_HS_HOST_OTG2_HS_DEVICE_OTG1_HS_PWRCLK","40040e00","0x3fe00"
"OTG2_HS_PWRCLK","40080e00","0x3f200"
"DCMI","48020000","0x400"
"RNG","48021800","0x400"
"SDMMC2","48022400","0x3fd"


*/


    create_unimplemented_device("CEC",0x40006c00,0x400);
    create_unimplemented_device("DAC_UART7_UART8",0x40007400,0xc00);
    create_unimplemented_device("CRS_SWPMI",0x40008400,0x800);
    create_unimplemented_device("MDIOS_OPAMP",0x40009000,0x800);
    create_unimplemented_device("FDCAN1_FDCAN2_CAN_CCU",0x4000a000,0xc00);
    //create_unimplemented_device("TIM1_TIM8",0x40010000,0x800);
    //create_unimplemented_device("USART1_USART6",0x40011000,0x800);
    create_unimplemented_device("SPI1_SPI4",0x40013000,0x800);
    create_unimplemented_device("TIM16_TIM17_TIM15",0x40014000,0xc00);
    create_unimplemented_device("SPI5",0x40015000,0x400);
    create_unimplemented_device("SAI1_SAI2_SAI3",0x40015800,0xc00);
    create_unimplemented_device("HRTIM_Master_HRTIM_TIMA_HRTIM_TIMB_HRTIM_TIMC_HRTIM_TIMD_HRTIM_TIME_DFSDM",0x40017000,0x700);
    create_unimplemented_device("HRTIM_Common",0x40017780,0x80);
    create_unimplemented_device("DMAMUX1_DMA2_DMA1",0x40020000,0xc00);
    create_unimplemented_device("ADC1",0x40022000,0xd1);
    create_unimplemented_device("ADC2",0x40022100,0xd1);
    create_unimplemented_device("ADC12_Common",0x40022300,0x11);
    create_unimplemented_device("Ethernet_MAC",0x40028000,0x1400);
    create_unimplemented_device("OTG1_HS_GLOBAL_OTG1_HS_HOST_OTG1_HS_DEVICE",0x40040000,0xc00);
    create_unimplemented_device("OTG2_HS_GLOBAL_OTG2_HS_HOST_OTG2_HS_DEVICE_OTG1_HS_PWRCLK",0x40040e00,0x3fe00);
    create_unimplemented_device("OTG2_HS_PWRCLK",0x40080e00,0x3f200);
    create_unimplemented_device("DCMI",0x48020000,0x400);
    create_unimplemented_device("RNG_HASH_CRYP",0x48021000,0xc00);
    create_unimplemented_device("SDMMC2",0x48022400,0x3fd);
//    "","",""
   create_unimplemented_device("RAMECC2",0x48023000,0x400);
//    create_unimplemented_device("DELAY_Block_SDMMC2",0x48022800,0x1000);
    create_unimplemented_device("LTDC",0x50001000,0x1000);
    create_unimplemented_device("WWDG2",0x50003000,0x400);
    create_unimplemented_device("DMA2D_MDMA",0x52000000,0x1400);
    create_unimplemented_device("FMC_JPEG_QUADSPI",0x52003000,0x3000);
    create_unimplemented_device("SDMMC1",0x52007000,0x1000);
    create_unimplemented_device("RAMECC1",0x52009000,0x400);
    create_unimplemented_device("SYSCFG_EXTI",0x58000000,0x800);
    create_unimplemented_device("LPUART1",0x58000c00,0x400);
    create_unimplemented_device("SPI6",0x58001400,0x400);
    create_unimplemented_device("I2C4",0x58001c00,0x400);
    create_unimplemented_device("LPTIM2_LPTIM3_LPTIM4_LPTIM5",0x58002400,0x1000);
    create_unimplemented_device("COMP1_VREFBUF_RTC",0x58003800,0xc00);
    create_unimplemented_device("IWDG1_IWDG2",0x58004800,0x800);
    create_unimplemented_device("SAI4",0x58005400,0x400);
    create_unimplemented_device("GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK",0x58020000,0x2c00);
    //create_unimplemented_device("PWR_CRC_RCC",0x58024400,0xc00);
    create_unimplemented_device("BDMA_DMAMUX2",0x58025400,0x800);
    create_unimplemented_device("HSEM_ADC3",0x58026000,0x800);
    create_unimplemented_device("RAMECC3",0x58027000,0x400);
    create_unimplemented_device("SCB_ACTRL",0xe000e008,0x5);
    create_unimplemented_device("STK",0xe000e010,0x11);
    create_unimplemented_device("NVIC",0xe000e100,0x351);
    create_unimplemented_device("SCB",0xe000ed00,0x41);
    create_unimplemented_device("FPU_CPACR",0xe000ed88,0x5);
    create_unimplemented_device("MPU",0xe000ed90,0x15);
    create_unimplemented_device("NVIC_STIR",0xe000ef00,0x5);

    create_unimplemented_device("Flash",0x52002000,0x1400);
    create_unimplemented_device("DBGMCU",0x5c001000,0x400);

    create_unimplemented_device("SWITCH_MATRIX",0x51008100,0x200);

    


