Ebiroll/artpi/qemu/hw/arm/stm32h7a3vih_soc.c
 /*   
    create_unimplemented_device("WWDG",0x50003000,0x400);
    create_unimplemented_device("AXI",0x51000000,0x100000);
    create_unimplemented_device("DMA2D_MDMA",0x52000000,0x1400);
                                       //   0x52005000
    create_unimplemented_device("JPEG_Flash",0x52002000,0x1400);
    create_unimplemented_device("FMC",0x52004000,0x400);
    //create_unimplemented_device("QUADSPI",0x52005000,0x400);
    create_unimplemented_device("SDMMC1_DELAY_Block_QUADSPI",0x52006000,0x13fd);
    create_unimplemented_device("DELAY_Block_SDMMC1",0x52008000,0x1000);
    create_unimplemented_device("SYSCFG_EXTI",0x58000000,0x800);
    create_unimplemented_device("LPUART1",0x58000c00,0x400);
    create_unimplemented_device("SPI6",0x58001400,0x400);
    create_unimplemented_device("I2C4",0x58001c00,0x400);
    create_unimplemented_device("LPTIM2_LPTIM3_LPTIM4_LPTIM5",0x58002400,0x1000);
    create_unimplemented_device("COMP1_VREFBUF_RTC",0x58003800,0xc00);
    create_unimplemented_device("IWDG",0x58004800,0x400);
    create_unimplemented_device("SAI4",0x58005400,0x400);
    create_unimplemented_device("GPIOA_GPIOB_GPIOC_GPIOD_GPIOE_GPIOF_GPIOG_GPIOH_GPIOI_GPIOJ_GPIOK",0x58020000,0x2c00);
    //create_unimplemented_device("PWR_CRC_RCC",0x58024400,0xc00);
    // STM32H750_POWERMGT
    create_unimplemented_device("BDMA_DMAMUX2",0x58025400,0x800);
    create_unimplemented_device("ADC3",0x58026000,0xd1);
    create_unimplemented_device("ADC3_Common",0x58026300,0x11);
    create_unimplemented_device("HSEM",0x58026400,0x400);
    create_unimplemented_device("DBGMCU",0x5c001000,0x400);
    create_unimplemented_device("SCB_ACTRL",0xe000e008,0x5);
    create_unimplemented_device("STK",0xe000e010,0x11);
    create_unimplemented_device("NVIC",0xe000e100,0x355);
    create_unimplemented_device("SCB",0xe000ed00,0x41);
    create_unimplemented_device("PF",0xe000ed78,0xd);
    create_unimplemented_device("FPU_CPACR",0xe000ed88,0x5);
    create_unimplemented_device("MPU",0xe000ed90,0x15);
    create_unimplemented_device("NVIC_STIR",0xe000ef00,0x5);
    create_unimplemented_device("FPU",0xe000ef34,0xd);
    create_unimplemented_device("AC",0xe000ef90,0x1d);
 */

}

static Property stm32h7x7_soc_properties[] = {
    DEFINE_PROP_STRING("cpu-type", STM32H7X7State, cpu_type),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32h7x7_soc_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = stm32h7x7_soc_realize;
    device_class_set_props(dc, stm32h7x7_soc_properties);
    /* No vmstate or reset required: device has no internal state */
}

static const TypeInfo stm32h7x7_soc_info = {
    .name          = TYPE_STM32H7X7_SOC,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32H7X7State),
    .instance_init = stm32h7x7_soc_initfn,
    .class_init    = stm32h7x7_soc_class_init,
};

static void stm32h7x7_soc_types(void)
{
    type_register_static(&stm32h7x7_soc_info);
}

type_init(stm32h7x7_soc_types)
